{
    "personal": {
      "name": "Muhammad Aziz Rahman",
      "location": "Tangerang selatan, Banten, Indonesia, 15223",
      "phone": "+62 812 8770 2280",
      "email": "aziz.mhmmd.r@gmail.com",
      "workEmail": "marahman@pmintl.net",
      "linkedin": "www.linkedin.com/in/muhammad-aziz-rahman",
      "about": "Physics graduate with strong expertise in geospatial analysis, data science, MLOps, and computer vision. Currently delivering comprehensive IT solutions for global supply chain tracking and compliance at Philip Morris International (PMI). Proven track record in cloud engineering, data management, cybersecurity, and developing end-to-end automation solutions. Passionate about staying current with technological advancements and consistently delivering high-quality, scalable solutions."
    },
    "education": {
      "university": "University of Indonesia",
      "location": "Depok, Indonesia",
      "degree": "Bachelor Degree in Physics",
      "gpa": "3.54/4.00",
      "period": "Jul 2017 - Aug 2021"
    },
    "skills": {
      "programming_languages": [
        "Python (Pandas, Airflow, Prefect Dataflow, Numpy, Manim, Regex, Scikit-Learn, Matplotlib, Seaborn, Pytorch, OpenCV, Selenium, BeautifulSoup, Django)",
        "C# (ASP.NET Framework)",
        "Rust",
        "Dart",
        "JavaScript",
        "Golang",
        "Fortran"
      ],
      "databases": [
        "Postgres",
        "MSSQL Server",
        "Snowflake"
      ],
      "tools": [
        "AWS (EC2, S3, RDS, Sagemaker, Lambda, Glue, DMS, KMS)",
        "Azure (Azure AD)",
        "GCP",
        "Terraform",
        "Hashicorp Vault",
        "Docker",
        "SSIS",
        "Google Earth Engine",
        "Ms. Power BI",
        "Tableau",
        "Airflow",
        "Talend",
        "KNIME Analytics",
        "Manim",
        "LaTeX",
        "Ms. Office"
      ],
      "certifications": [
        "Azure AI Fundamentals",
        "Microsoft Security, Compliance, and Identity Fundamentals"
      ]
    },
    "experience": [
      {
        "title": "IT Solution Track & Trace",
        "company": "Philip Morris International",
        "location": "Jakarta, Indonesia • Remote",
        "period": "Mar 2023 - Present",
        "description": "Delivering comprehensive IT solutions for global supply chain tracking and compliance of Reduced Risk Product with expertise across cloud engineering, data management, development, and cybersecurity ensuring regulatory compliance and operational excellence.",
        "achievements": [
          "Managed Track&Trace AWS services through terraform scripts, implementing infrastructure as code practices to maintain consistent and scalable cloud environments across multiple regions",
          "Collaborated with stakeholders across PMI affiliates to develop comprehensive documentation for track and trace systems validation ensuring compliance with European Tobacco Products Directive (EUTPD) revision requirements",
          "Implemented CDC using AWS DMS to synchronize and distribute essential production data across all PMI affiliates globally, serving as blueprint for manufacturing operations",
          "Planned and executed MSSQL database migration from on-premises to Amazon RDS by assessing instance types, calculating cost projections for management approval, performing backup/restore operations, and configuring SSIS integration to address critical vulnerabilities while enhancing scalability, availability, and security",
          "Conducted vulnerability remediation to enhance system security by resolving critical security issues detected by security teams, while acting as DevSecOps infrastructure administrator deploying .NET applications",
          "Implemented secret management migration to dedicated secret manager solutions, enhancing security posture by centralizing credential management",
          "Developed automation pipeline for product traceability reporting using Prefect Data Flow, improving operational monitoring and stakeholder communication through automated email reporting",
          "Developed solutions from data engineering & automation pipelines to front-end interfaces, enhancing existing end-to-end systems that streamline business processes"
        ]
      },
      {
        "title": "Data Engineer",
        "company": "Aptaworks",
        "location": "Jakarta, Indonesia",
        "period": "Jan 2022 - Present",
        "description": "Crafting IT solution for multi-national companies:",
        "achievements": [
          "Custom algorithm optimizing plant/factory production by implementing combinatorics and discrete mathematics to evaluate manufacturing sequences, maximizing daily output capacity while reducing bottlenecks",
          "Researched and developed GEOINT solutions utilizing remote sensing, Dijkstra's algorithm, and isochrone mapping by strategically combining geodata with scraped information to generate critical business insights and optimize decision-making processes",
          "Inventory projection and raw material readiness ensuring optimal supply chain efficiency through predictive demand modeling",
          "Migrating data warehouses from Redshift to Snowflake and transforming on-premises PostgreSQL and MSSQL databases to cloud infrastructure, optimizing performance and scalability",
          "Developed and implemented proprietary vision, language, and statistical models delivering customized AI solutions for complex business intelligence and automated analytics workflows",
          "Implementing LLMs for various problems including retrieval-augmented generation systems and multilingual transcription-translation applications to enhance information processing capabilities"
        ]
      },
      {
        "title": "Mathematical Animator",
        "company": "RareSkills",
        "location": "World-wide • Remote",
        "period": "Apr 2024 - Nov 2024",
        "description": "Animating maths behind cryptography to web3 developer:",
        "achievements": [
          "Modular arithmetic",
          "Abstract algebra",
          "Linear algebra",
          "Group and Field Theory",
          "Elliptic Curve Cryptography (ECC)"
        ]
      },
      {
        "title": "Assistant Lecturer for Introduction to Solid State Physics",
        "company": "University of Indonesia",
        "location": "Part-time",
        "period": "Sep 2020 - Jan 2021"
      },
      {
        "title": "Laboratory Teaching Assistant at Fundamental Physics Laboratory",
        "company": "University of Indonesia",
        "period": "Jun 2019 - Nov 2019"
      }
    ],
    "portfolio_videos": [
      {
        "title": "Mathematical Animations with Manim",
        "filename": "NewTwosComplementDemo.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      },
      {
        "title": "Mathematical Animations with Manim",
        "filename": "ThreeWayInnerProduct.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      },
      {
        "title": "Mathematical Animations with Manim",
        "filename": "ReserveCurveVisualization.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      }
    ],
    "blog_posts": [
      {
        "id": 1,
        "title": "Under construction",
        "date": "2024-02-10",
        "excerpt": "Under construction",
        "tags": [""],
        "content": "<h2>Under construction</h2><p>Under construction.</p>"
      }
    ]
  }
