
{
    "personal": {
      "name": "Muhammad Aziz Rahman",
      "location": "Tangerang selatan, Banten, Indonesia, 15223",
      "phone": "+62 812 8770 2280",
      "email": "aziz.mhmmd.r@gmail.com",
      "workEmail": "marahman@pmintl.net",
      "linkedin": "www.linkedin.com/in/muhammad-aziz-rahman",
      "about": "Muhammad Aziz Rahman, a highly motivated and detail-oriented physics undergraduate from University of Indonesia, I have a strong passion for geospatial analysis, machine learning, and computer vision. With my current position as a Data Engineer at PT Aptaworks and IT Solution Track & Trace role at Philip Morris International, I have honed my skills in Python programming, data pipelines, machine learning, and DevSecOps infrastructure management. My experience working on data-driven projects (especially in Supply Chain Management) and solid academic background have given me a strong foundation in analytical thinking and problem-solving. Committed to staying up-to-date with the latest advancements in the field, I strive to consistently deliver high-quality work."
    },
    "education": {
      "university": "University of Indonesia",
      "location": "Depok, Indonesia",
      "degree": "Bachelor Degree in Physics",
      "gpa": "3.54/4.00",
      "period": "Jul 2017 - Aug 2021"
    },
    "skills": {
      "programming_languages": [
        "Python (Pandas, Airflow, Prefect Dataflow, Numpy, Manim, Regex, Scikit-Learn, Matplotlib, Seaborn, Pytorch, OpenCV, Selenium, BeautifulSoup, Django)",
        "C# (ASP.NET Framework)",
        "Rust",
        "Dart",
        "JavaScript",
        "Golang",
        "Fortran"
      ],
      "databases": [
        "Postgres",
        "MSSQL Server",
        "Snowflake"
      ],
      "tools": [
        "AWS (EC2, S3, RDS, Sagemaker, Lambda, Glue, DMS, KMS)",
        "Azure (Azure AD)",
        "GCP",
        "Terraform",
        "Hashicorp Vault",
        "Docker",
        "SSIS",
        "Google Earth Engine",
        "Ms. Power BI",
        "Tableau",
        "Airflow",
        "Talend",
        "KNIME Analytics",
        "Manim",
        "LaTeX",
        "Ms. Office"
      ],
      "certifications": [
        "Azure AI Fundamentals",
        "Microsoft Security, Compliance, and Identity Fundamentals"
      ]
    },
    "experience": [
      {
        "title": "Data Engineer",
        "company": "Aptaworks",
        "location": "Jakarta, Indonesia",
        "period": "Jan 2022 - Present",
        "description": "Crafting IT solution for multi-national companies with expertise in data engineering, machine learning, and supply chain optimization.",
        "achievements": [
          "Custom algorithm optimizing plant/factory production by implementing combinatorics and discrete mathematics to evaluate manufacturing sequences, maximizing daily output capacity while reducing bottlenecks",
          "Researched and developed GEOINT solutions utilizing remote sensing, Dijkstra's algorithm, and isochrone mapping by strategically combining geodata with scraped information to generate critical business insights and optimize decision-making processes",
          "Inventory projection and raw material readiness ensuring optimal supply chain efficiency through predictive demand modeling",
          "Migrating data warehouses from Redshift to Snowflake and transforming on-premises PostgreSQL and MSSQL databases to cloud infrastructure, optimizing performance and scalability",
          "Developed and implemented proprietary vision, language, and statistical models delivering customized AI solutions for complex business intelligence and automated analytics workflows",
          "Implementing LLMs for various problems including retrieval-augmented generation systems and multilingual transcription-translation applications to enhance information processing capabilities"
        ]
      },
      {
        "title": "IT Solution Track & Trace",
        "company": "Philip Morris International",
        "location": "Jakarta, Indonesia",
        "period": "Mar 2023 - Present",
        "description": "Delivering comprehensive IT solutions for global supply chain tracking and compliance.",
        "achievements": [
          "Reduced risk product (RRP) traceability with expertise across cloud engineering, data management, development, and cybersecurity ensuring regulatory compliance and operational excellence",
          "Managed Track&Trace AWS services through terraform scripts, implementing infrastructure as code practices to maintain consistent and scalable cloud environments across multiple regions",
          "Conducted vulnerability remediation to enhance system security by resolving critical security issues detected by security teams, while acting as DevSecOps infrastructure administrator deploying .NET applications and managing MSSQL databases on Amazon RDS with SSIS integration",
          "Migrated production databases from on-premises to cloud environments, orchestrating seamless transitions while maintaining zero-downtime operations and data integrity",
          "Implemented secret management migration to dedicated secret manager solutions, enhancing security posture by centralizing credential management and automated rotation policies",
          "Administered Azure Active Directory for enterprise access management and single sign-on (SSO) solutions to secure application access while maintaining compliance with corporate security policies",
          "Implemented CDC to synchronize and distribute essential production data across all PMI affiliates globally, serving as blueprint for manufacturing operations",
          "Developed solutions from data engineering & automation pipelines to front-end interfaces, creating end-to-end systems that streamline business processes"
        ]
      },
      {
        "title": "Mathematical Animator",
        "company": "RareSkills",
        "location": "World-wide",
        "period": "Apr 2024 - Nov 2024",
        "description": "Animating maths behind cryptography to web3 developer using Manim library for educational content creation."
      }
    ],
    "portfolio_videos": [
      {
        "title": "Mathematical Animations with Manim",
        "filename": "NewTwosComplementDemo.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      },
      {
        "title": "Mathematical Animations with Manim",
        "filename": "ThreeWayInnerProduct.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      },
      {
        "title": "Mathematical Animations with Manim",
        "filename": "ReserveCurveVisualization.gif",
        "description": "A showcase of mathematical concept animations created for blockchain education using Manim library.",
        "technologies": ["Python", "Manim", "Mathematics", "Animation"]
      }
    ],
    "blog_posts": [
      {
        "id": 1,
        "title": "Under construction",
        "date": "2024-02-10",
        "excerpt": "Under construction",
        "tags": [""],
        "content": "<h2>Under construction</h2><p>Under construction.</p>"
      }
    ]
  }
